{
  "section": {
    "title": "Projets"
  },
  "ui": {
    "swipeInstruction": "Glissez vers la gauche ou la droite pour naviguer",
    "previousPage": "Page précédente",
    "nextPage": "Page suivante",
    "pageOf": "Page {current} sur {total}",
    "code": "Code",
    "demo": "Démo",
    "viewAll": "Voir tous les projets",
    "projectCount": {
      "single": "{count} projet",
      "multiple": "{count} projets"
    }
  },
  "projects": {
    "teapotTracker": {
      "title": "TeapotTracker",
      "description": "Bot Discord qui met à jour son statut basé sur le suivi du temps reçu via clockify. Implémente une Clean Architecture avec Domain-Driven Design, déploiement automatisé avec PM2 et mises à jour en temps réel des sessions de travail. Le bot écoute les webhooks et affiche différents statuts selon l'activité."
    },
    "chromeFlex": {
      "title": "ChromeFlex",
      "description": "Framework d'extension Chrome modulaire pour ajouter facilement des fonctionnalités personnalisées spécifiques aux sites avec une architecture plug-and-play. Construit avec TypeScript et des outils de développement modernes, il offre aux développeurs une plateforme flexible pour améliorer l'expérience de navigation web."
    },
    "atlasGenAI": {
      "title": "Atlas-GenAI",
      "description": "Projet alimenté par l'IA avec des capacités génératives avancées et des fonctionnalités d'automatisation intelligente. Construit avec TypeScript et Python, incluant la conteneurisation Docker pour un déploiement évolutif. Le projet exploite les technologies IA modernes pour fournir des solutions sophistiquées."
    },
    "invoicing": {
      "title": "Système de Facturation",
      "description": "Système moderne de facturation et de gestion des paiements construit avec TypeScript pour les petites entreprises et freelances. Génération automatisée de factures, gestion complète des clients, suivi des paiements et rapports financiers avec une interface React intuitive. Simplifie tout le processus de facturation."
    },
    "epitechIntranetStatistics": {
      "title": "Epitech Intranet Statistics",
      "description": "Application web fournissant des statistiques avancées pour la plateforme Intranet Epitech. Extension Chrome avec visualisation complète des données, tableau de bord personnalisable pour le suivi académique et fonctionnalités d'expérience utilisateur améliorées. Aide les étudiants à suivre efficacement leur parcours académique."
    },
    "rtype": {
      "title": "Jeu R-Type",
      "description": "Jeu de tir à défilement horizontal 2D basé sur le classique arcade R-Type original. Construit en C++ avec une architecture client-serveur robuste, gameplay multijoueur, support multi-plateforme et pratiques modernes de développement de jeux. Inclut l'architecture Entity Component System et la synchronisation réseau."
    },
    "epitechArea": {
      "title": "Epitech AREA",
      "description": "Plateforme d'automatisation connectant différents services et applications via des workflows et intégrations personnalisés. Construit avec JavaScript et React, permettant aux utilisateurs de créer des règles d'automatisation sophistiquées entre diverses APIs et services. Similaire à IFTTT mais adapté aux besoins des développeurs et étudiants."
    },
    "myFarm": {
      "title": "MyFarm RPG",
      "description": "Moteur de jeu RPG personnalisé développé en C avec des mécaniques classiques de simulation agricole. Gestion complète des ressources, système de progression des personnages et environnement de jeu rétro. Les joueurs peuvent cultiver des récoltes, gérer le bétail et construire leur empire agricole virtuel avec des éléments de prise de décision stratégique."
    }
  }
}