{
  "section": {
    "title": "Projects"
  },
  "ui": {
    "swipeInstruction": "Swipe left or right to navigate",
    "previousPage": "Previous page",
    "nextPage": "Next page",
    "pageOf": "Page {current} of {total}",
    "code": "Code",
    "demo": "Demo",
    "viewAll": "View all projects",
    "projectCount": {
      "single": "{count} project",
      "multiple": "{count} projects"
    }
  },
  "projects": {
    "teapotTracker": {
      "title": "TeapotTracker",
      "description": "Discord bot that updates its status based on time tracking received via clockify. Features Clean Architecture with Domain-Driven Design, automated deployment with PM2, and real-time status updates for work sessions. The bot listens for webhook payloads and displays different statuses based on work activity."
    },
    "chromeFlex": {
      "title": "ChromeFlex",
      "description": "Modular Chrome extension framework for easily adding custom, site-specific features on the fly with a plug-and-play architecture. Built with TypeScript and modern development tools, it provides developers with a flexible platform to enhance web browsing experiences across different websites."
    },
    "atlasGenAI": {
      "title": "Atlas-GenAI",
      "description": "AI-powered project with advanced generative capabilities and intelligent automation features. Built with TypeScript and Python, featuring Docker containerization for scalable deployment and development. The project leverages modern AI technologies to provide sophisticated solutions for various use cases."
    },
    "invoicing": {
      "title": "Invoicing System",
      "description": "Modern invoicing and billing system built with TypeScript for small businesses and freelancers. Features automated invoice generation, comprehensive client management, payment tracking, and financial reporting with a clean and intuitive React interface. Streamlines the entire billing process from creation to payment."
    },
    "epitechIntranetStatistics": {
      "title": "Epitech Intranet Statistics",
      "description": "Web application providing advanced statistics and information for the Epitech Intranet platform. Chrome extension with comprehensive data visualization, customizable dashboard for tracking academic progress, and enhanced user experience features. Helps students monitor their academic journey more effectively."
    },
    "rtype": {
      "title": "R-Type Game",
      "description": "2D side-scrolling shoot'em up game based on the original R-Type arcade classic. Built in C++ with robust client-server architecture, featuring multiplayer gameplay, cross-platform support, and modern game development practices. Includes Entity Component System architecture and network synchronization."
    },
    "epitechArea": {
      "title": "Epitech AREA",
      "description": "Automation platform connecting different services and applications through custom workflows and integrations. Built with JavaScript and React, enabling users to create sophisticated automation rules between various APIs and services. Similar to IFTTT but tailored for developer and student needs."
    },
    "myFarm": {
      "title": "MyFarm RPG",
      "description": "Custom RPG game engine developed in C with classic farming simulation mechanics. Features comprehensive resource management, character progression system, and retro-style gaming environment. Players can cultivate crops, manage livestock, and build their virtual farming empire with strategic decision-making elements."
    }
  }
}
